# Taps
tap "FelixKratz/formulae"
tap "joshmedeski/sesh"
tap "koekeishiya/formulae"

# Core tools
brew "fish"
brew "neovim"
brew "luarocks"
brew "tmux"
brew "ghostty"
brew "starship"
brew "sketchybar"
brew "yabai"
brew "skhd"
brew "bun"
brew "atuin"
brew "btop"
brew "yazi"
brew "neofetch"
brew "stow"
brew "powerlevel10k"
brew "spicetify-cli"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "zoxide"
brew "bat"
brew "borders"
brew "lua"
brew "git"
brew "lazygit"
brew "joshmedeski/sesh/sesh"
brew "gh"
brew "fastfetch"
brew "opencode"
brew "cbonsai"
brew "eza"

# Casks
cask "appcleaner"
cask "kitty"
cask "zed"
cask "raycast"
cask "shottr"
cask "alt-tab"
cask "font-cascadia-code-nf"
cask "zen"
cask "spotify"
cask "vscodium"
cask "sketchybar-app-font"
cask "obsidian"
cask "nikitabobko/tap/aerospace"
cask "kindavim"
