# Taps
tap "FelixKratz/formulae"
tap "joshmedeski/sesh"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"

# Core tools
brew "fish"
brew "neovim"
brew "luarocks"
brew "tmux"
brew "ghostty"
brew "starship"
brew "sketchybar"
brew "yabai"
brew "skhd"
brew "bun"
brew "npm"
brew "atuin"
brew "bandwhich"
brew "btop"
brew "yazi"
brew "neofetch"
brew "stow"
brew "powerlevel10k"
brew "spicetify-cli"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "zoxide"
brew "bat"
brew "borders"
brew "lua"
brew "mole"
brew "ngrok"
brew "git"
brew "lazygit"
brew "joshmedeski/sesh/sesh"
brew "gh"
brew "pass"
brew "pass-otp"
brew "gnupg"
brew "imagemagick"
brew "fastfetch"
brew "pi-coding-agent"
brew "opencode"
brew "cbonsai"
brew "eza"
brew "delta"
brew "duf"
brew "dust"
brew "ffmpeg"
brew "gdu"
brew "jq"
brew "just"
brew "ouch"
brew "sevenzip"
brew "tree"

# Casks
cask "clop"
cask "appcleaner"
cask "kitty"
cask "zed"
cask "raycast"
cask "shottr"
cask "alt-tab"
cask "font-cascadia-code-nf"
cask "zen"
cask "spotify"
cask "sketchybar-app-font"
cask "obsidian"
cask "aerospace"
cask "kindavim"
cask "localsend"
cask "finetune"
cask "latest"
cask "protonvpn"
cask "stats"
cask "vesktop"
cask "iina"
